tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "snyk/tap"
# User-friendly launcher for Bazel
brew "bazelisk"
# Cross-platform make
brew "cmake"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# OpenGL Extension Wrangler Library
brew "glew"
# Multi-platform library for OpenGL applications
brew "glfw"
# C++ mathematics library for graphics software
brew "glm"
# Statically typed programming language for the JVM
brew "kotlin"
# Network authentication protocol
brew "krb5"
# C interface for Google's OS library for Machine Intelligence
brew "libtensorflow"
# Next-gen compiler infrastructure
brew "llvm"
# Text-based UI library
brew "ncurses"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Highly capable, feature-rich programming language
brew "perl"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Tool Command Language
brew "tcl-tk"
# Software environment for statistical computing
brew "r"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Enable Windows-like alt-tab
cask "alt-tab"
cask "visual-studio-code"
cask "discord"
cask "zoom"
cask "microsoft-teams"
cask "alfred"
cask "notion"
cask "anki"
cask "audacity"
cask "todoist"
cask "rectangle"
cask "messenger"
cask "blender"
cask "wechat"
cask "microsoft-edge"